{"keras_version": "2.0.8", "backend": "tensorflow", "config": [{"config": {"sparse": false, "batch_input_shape": [null, 256, 256, 1], "name": "input_1", "dtype": "float32"}, "class_name": "InputLayer"}, {"config": {"kernel_constraint": null, "bias_regularizer": null, "name": "conv2d_1", "activation": "relu", "kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dilation_rate": [1, 1], "use_bias": true, "filters": 64, "kernel_size": [3, 3], "data_format": "channels_last", "bias_constraint": null, "trainable": true, "padding": "same", "activity_regularizer": null, "kernel_regularizer": null, "strides": [1, 1]}, "class_name": "Conv2D"}, {"config": {"kernel_constraint": null, "bias_regularizer": null, "name": "conv2d_2", "activation": "relu", "kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dilation_rate": [1, 1], "use_bias": true, "filters": 64, "kernel_size": [3, 3], "data_format": "channels_last", "bias_constraint": null, "trainable": true, "padding": "same", "activity_regularizer": null, "kernel_regularizer": null, "strides": [2, 2]}, "class_name": "Conv2D"}, {"config": {"kernel_constraint": null, "bias_regularizer": null, "name": "conv2d_3", "activation": "relu", "kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dilation_rate": [1, 1], "use_bias": true, "filters": 128, "kernel_size": [3, 3], "data_format": "channels_last", "bias_constraint": null, "trainable": true, "padding": "same", "activity_regularizer": null, "kernel_regularizer": null, "strides": [1, 1]}, "class_name": "Conv2D"}, {"config": {"kernel_constraint": null, "bias_regularizer": null, "name": "conv2d_4", "activation": "relu", "kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dilation_rate": [1, 1], "use_bias": true, "filters": 128, "kernel_size": [3, 3], "data_format": "channels_last", "bias_constraint": null, "trainable": true, "padding": "same", "activity_regularizer": null, "kernel_regularizer": null, "strides": [2, 2]}, "class_name": "Conv2D"}, {"config": {"kernel_constraint": null, "bias_regularizer": null, "name": "conv2d_5", "activation": "relu", "kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dilation_rate": [1, 1], "use_bias": true, "filters": 256, "kernel_size": [3, 3], "data_format": "channels_last", "bias_constraint": null, "trainable": true, "padding": "same", "activity_regularizer": null, "kernel_regularizer": null, "strides": [1, 1]}, "class_name": "Conv2D"}, {"config": {"kernel_constraint": null, "bias_regularizer": null, "name": "conv2d_6", "activation": "relu", "kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dilation_rate": [1, 1], "use_bias": true, "filters": 256, "kernel_size": [3, 3], "data_format": "channels_last", "bias_constraint": null, "trainable": true, "padding": "same", "activity_regularizer": null, "kernel_regularizer": null, "strides": [2, 2]}, "class_name": "Conv2D"}, {"config": {"kernel_constraint": null, "bias_regularizer": null, "name": "conv2d_7", "activation": "relu", "kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dilation_rate": [1, 1], "use_bias": true, "filters": 512, "kernel_size": [3, 3], "data_format": "channels_last", "bias_constraint": null, "trainable": true, "padding": "same", "activity_regularizer": null, "kernel_regularizer": null, "strides": [1, 1]}, "class_name": "Conv2D"}, {"config": {"kernel_constraint": null, "bias_regularizer": null, "name": "conv2d_8", "activation": "relu", "kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dilation_rate": [1, 1], "use_bias": true, "filters": 256, "kernel_size": [3, 3], "data_format": "channels_last", "bias_constraint": null, "trainable": true, "padding": "same", "activity_regularizer": null, "kernel_regularizer": null, "strides": [1, 1]}, "class_name": "Conv2D"}, {"config": {"kernel_constraint": null, "bias_regularizer": null, "name": "conv2d_9", "activation": "relu", "kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dilation_rate": [1, 1], "use_bias": true, "filters": 128, "kernel_size": [3, 3], "data_format": "channels_last", "bias_constraint": null, "trainable": true, "padding": "same", "activity_regularizer": null, "kernel_regularizer": null, "strides": [1, 1]}, "class_name": "Conv2D"}, {"config": {"trainable": true, "size": [2, 2], "data_format": "channels_last", "name": "up_sampling2d_1"}, "class_name": "UpSampling2D"}, {"config": {"kernel_constraint": null, "bias_regularizer": null, "name": "conv2d_10", "activation": "relu", "kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dilation_rate": [1, 1], "use_bias": true, "filters": 64, "kernel_size": [3, 3], "data_format": "channels_last", "bias_constraint": null, "trainable": true, "padding": "same", "activity_regularizer": null, "kernel_regularizer": null, "strides": [1, 1]}, "class_name": "Conv2D"}, {"config": {"trainable": true, "size": [2, 2], "data_format": "channels_last", "name": "up_sampling2d_2"}, "class_name": "UpSampling2D"}, {"config": {"kernel_constraint": null, "bias_regularizer": null, "name": "conv2d_11", "activation": "relu", "kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dilation_rate": [1, 1], "use_bias": true, "filters": 32, "kernel_size": [3, 3], "data_format": "channels_last", "bias_constraint": null, "trainable": true, "padding": "same", "activity_regularizer": null, "kernel_regularizer": null, "strides": [1, 1]}, "class_name": "Conv2D"}, {"config": {"kernel_constraint": null, "bias_regularizer": null, "name": "conv2d_12", "activation": "tanh", "kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dilation_rate": [1, 1], "use_bias": true, "filters": 2, "kernel_size": [3, 3], "data_format": "channels_last", "bias_constraint": null, "trainable": true, "padding": "same", "activity_regularizer": null, "kernel_regularizer": null, "strides": [1, 1]}, "class_name": "Conv2D"}, {"config": {"trainable": true, "size": [2, 2], "data_format": "channels_last", "name": "up_sampling2d_3"}, "class_name": "UpSampling2D"}], "class_name": "Sequential"}